; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=48, out_folder=htg/blocksworld/training, instance_id=28, seed=2052

(define (problem blocksworld-28)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 - object)
 (:init 
    (arm-empty)
    (clear b40)
    (on b40 b6)
    (on b6 b17)
    (on b17 b12)
    (on b12 b3)
    (on-table b3)
    (clear b23)
    (on b23 b14)
    (on b14 b18)
    (on b18 b10)
    (on b10 b32)
    (on b32 b30)
    (on b30 b20)
    (on b20 b48)
    (on b48 b16)
    (on b16 b39)
    (on b39 b46)
    (on b46 b24)
    (on b24 b27)
    (on b27 b41)
    (on b41 b29)
    (on b29 b19)
    (on b19 b13)
    (on b13 b8)
    (on b8 b21)
    (on b21 b28)
    (on b28 b11)
    (on b11 b1)
    (on b1 b36)
    (on-table b36)
    (clear b38)
    (on b38 b4)
    (on b4 b47)
    (on b47 b31)
    (on b31 b45)
    (on b45 b34)
    (on b34 b9)
    (on b9 b7)
    (on b7 b37)
    (on b37 b25)
    (on b25 b5)
    (on b5 b15)
    (on b15 b2)
    (on b2 b42)
    (on b42 b35)
    (on b35 b44)
    (on b44 b26)
    (on b26 b33)
    (on b33 b22)
    (on b22 b43)
    (on-table b43))
 (:goal  (and 
    (clear b2)
    (on-table b2)
    (clear b4)
    (on b4 b1)
    (on b1 b3)
    (on-table b3))))

; plan
1. (unstack b38 b4)
   deleted: (on b38 b4) (clear b38) (arm-empty)
   added: (holding b38) (clear b4)
   goals met: 2 of 6
2. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 2 of 6
3. (unstack b40 b6)
   deleted: (on b40 b6) (clear b40) (arm-empty)
   added: (holding b40) (clear b6)
   goals met: 2 of 6
4. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 2 of 6
5. (unstack b23 b14)
   deleted: (on b23 b14) (clear b23) (arm-empty)
   added: (holding b23) (clear b14)
   goals met: 2 of 6
6. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 2 of 6
7. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 2 of 6
8. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 2 of 6
9. (unstack b18 b10)
   deleted: (on b18 b10) (clear b18) (arm-empty)
   added: (holding b18) (clear b10)
   goals met: 2 of 6
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 6
11. (unstack b6 b17)
   deleted: (on b6 b17) (clear b6) (arm-empty)
   added: (holding b6) (clear b17)
   goals met: 2 of 6
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 6
13. (unstack b17 b12)
   deleted: (on b17 b12) (clear b17) (arm-empty)
   added: (holding b17) (clear b12)
   goals met: 2 of 6
14. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 6
15. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 2 of 6
16. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 6
17. (unstack b10 b32)
   deleted: (on b10 b32) (clear b10) (arm-empty)
   added: (holding b10) (clear b32)
   goals met: 2 of 6
18. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 2 of 6
19. (unstack b32 b30)
   deleted: (on b32 b30) (clear b32) (arm-empty)
   added: (holding b32) (clear b30)
   goals met: 2 of 6
20. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 2 of 6
21. (unstack b30 b20)
   deleted: (on b30 b20) (clear b30) (arm-empty)
   added: (holding b30) (clear b20)
   goals met: 2 of 6
22. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 2 of 6
23. (unstack b20 b48)
   deleted: (on b20 b48) (clear b20) (arm-empty)
   added: (holding b20) (clear b48)
   goals met: 2 of 6
24. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 6
25. (unstack b48 b16)
   deleted: (on b48 b16) (clear b48) (arm-empty)
   added: (holding b48) (clear b16)
   goals met: 2 of 6
26. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 2 of 6
27. (unstack b16 b39)
   deleted: (on b16 b39) (clear b16) (arm-empty)
   added: (holding b16) (clear b39)
   goals met: 2 of 6
28. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 6
29. (unstack b39 b46)
   deleted: (on b39 b46) (clear b39) (arm-empty)
   added: (holding b39) (clear b46)
   goals met: 2 of 6
30. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 2 of 6
31. (unstack b46 b24)
   deleted: (on b46 b24) (clear b46) (arm-empty)
   added: (holding b46) (clear b24)
   goals met: 2 of 6
32. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 2 of 6
33. (unstack b24 b27)
   deleted: (on b24 b27) (clear b24) (arm-empty)
   added: (holding b24) (clear b27)
   goals met: 2 of 6
34. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 2 of 6
35. (unstack b27 b41)
   deleted: (on b27 b41) (clear b27) (arm-empty)
   added: (holding b27) (clear b41)
   goals met: 2 of 6
36. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 2 of 6
37. (unstack b41 b29)
   deleted: (on b41 b29) (clear b41) (arm-empty)
   added: (holding b41) (clear b29)
   goals met: 2 of 6
38. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 2 of 6
39. (unstack b29 b19)
   deleted: (on b29 b19) (clear b29) (arm-empty)
   added: (holding b29) (clear b19)
   goals met: 2 of 6
40. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 6
41. (unstack b19 b13)
   deleted: (on b19 b13) (clear b19) (arm-empty)
   added: (holding b19) (clear b13)
   goals met: 2 of 6
42. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 2 of 6
43. (unstack b13 b8)
   deleted: (on b13 b8) (clear b13) (arm-empty)
   added: (holding b13) (clear b8)
   goals met: 2 of 6
44. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 6
45. (unstack b8 b21)
   deleted: (on b8 b21) (clear b8) (arm-empty)
   added: (holding b8) (clear b21)
   goals met: 2 of 6
46. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 6
47. (unstack b21 b28)
   deleted: (on b21 b28) (clear b21) (arm-empty)
   added: (holding b21) (clear b28)
   goals met: 2 of 6
48. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 6
49. (unstack b28 b11)
   deleted: (on b28 b11) (clear b28) (arm-empty)
   added: (holding b28) (clear b11)
   goals met: 2 of 6
50. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 2 of 6
51. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 2 of 6
52. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 6
53. (unstack b1 b36)
   deleted: (on b1 b36) (clear b1) (arm-empty)
   added: (holding b1) (clear b36)
   goals met: 2 of 6
54. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 3 of 6
55. (unstack b4 b47)
   deleted: (on b4 b47) (clear b4) (arm-empty)
   added: (holding b4) (clear b47)
   goals met: 2 of 6
56. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 4 of 6
57. (unstack b47 b31)
   deleted: (on b47 b31) (clear b47) (arm-empty)
   added: (holding b47) (clear b31)
   goals met: 4 of 6
58. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 4 of 6
59. (unstack b31 b45)
   deleted: (on b31 b45) (clear b31) (arm-empty)
   added: (holding b31) (clear b45)
   goals met: 4 of 6
60. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 4 of 6
61. (unstack b45 b34)
   deleted: (on b45 b34) (clear b45) (arm-empty)
   added: (holding b45) (clear b34)
   goals met: 4 of 6
62. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 4 of 6
63. (unstack b34 b9)
   deleted: (on b34 b9) (clear b34) (arm-empty)
   added: (holding b34) (clear b9)
   goals met: 4 of 6
64. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 4 of 6
65. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 4 of 6
66. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 4 of 6
67. (unstack b7 b37)
   deleted: (on b7 b37) (clear b7) (arm-empty)
   added: (holding b7) (clear b37)
   goals met: 4 of 6
68. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 6
69. (unstack b37 b25)
   deleted: (on b37 b25) (clear b37) (arm-empty)
   added: (holding b37) (clear b25)
   goals met: 4 of 6
70. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 4 of 6
71. (unstack b25 b5)
   deleted: (on b25 b5) (clear b25) (arm-empty)
   added: (holding b25) (clear b5)
   goals met: 4 of 6
72. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 4 of 6
73. (unstack b5 b15)
   deleted: (on b5 b15) (clear b5) (arm-empty)
   added: (holding b5) (clear b15)
   goals met: 4 of 6
74. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 4 of 6
75. (unstack b15 b2)
   deleted: (on b15 b2) (clear b15) (arm-empty)
   added: (holding b15) (clear b2)
   goals met: 5 of 6
76. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 6
77. (unstack b2 b42)
   deleted: (on b2 b42) (clear b2) (arm-empty)
   added: (holding b2) (clear b42)
   goals met: 4 of 6
78. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 6
